---
kind: other
id: Methods.T:Autodesk.Revit.DB.NestedFamilyTypeReference
source: html/54dbbd9a-9be6-2521-48b1-d4e85bec03eb.htm
---
# NestedFamilyTypeReference Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.